app/Controllers/Home.php

SELECT *
FROM `perusahaan`
WHERE `perusahaan`.`peruid` = 1
SELECT *
FROM `branch`
---
    public function index()
    {
        // menampilkan data perusahaan
        $modelPerusahaan = new ModelPerusahaan();
        $rowPeru = $modelPerusahaan->find(1);

        // menampilkan branch
        $modelBranch = new ModelBranch();
        $cekBranch = $modelBranch->findAll();

SELECT *
FROM `baner`
---
    function tampilBaner()
    {
        if ($this->request->isAJAX()) {
            $modelBaner = new ModelBaner();
            $dataBaner = $modelBaner->findAll();

SELECT *
FROM `perusahaan`
WHERE `perusahaan`.`peruid` = 1
SELECT *
FROM `branch`
---
    public function katalog()
    {
        // menampilkan data perusahaan
        $modelPerusahaan = new ModelPerusahaan();
        $rowPeru = $modelPerusahaan->find(1);

        // menampilkan branch
        $modelBranch = new ModelBranch();
        $cekBranch = $modelBranch->findAll();

SELECT *
FROM `product`
---
    function katalogTampil()
    {
        if ($this->request->isAJAX()) {
            $modelProduct = new ModelProduct();
            $dataProduct = $modelProduct->findAll();

SELECT *
FROM `perusahaan`
WHERE `perusahaan`.`peruid` = 1
SELECT *
FROM `branch`
WHERE `branch`.`branchid` = '1'
SELECT *
FROM `branch`
---
    public function katalogdetail($id)
    {
        // menampilkan data perusahaan
        $modelPerusahaan = new ModelPerusahaan();
        $rowPeru = $modelPerusahaan->find(1);

        $modelProduct = new ModelProduct();
        $rowProduct = $modelProduct->cekProduct($id)->getRowArray();

        $modelProductDetail = new ModelProductDetail();

        $modelBranch = new ModelBranch();
        $rowBranch = $modelBranch->find($rowProduct['prodbranch']);


        $cekBranch = $modelBranch->findAll();

SELECT *
FROM `product`
WHERE `product`.`prodid` = '1,Sutino'
---
    function modalTambahKeranjang($id)
    {
        if ($this->request->isAJAX()) {
            $modelProduct = new ModelProduct();
            $dataProduct = $modelProduct->find($id);