app/Controllers/Home.php

SELECT *
FROM `users`
WHERE `users`.`userid` = 'sutino.skom@gmail.com'
---
    function modalTambahKeranjang()
    {
        if ($this->request->isAJAX()) {
            $kerbrgid = $this->request->getvar('id');
            $keruser = $this->request->getvar('iduser');

            $modelProduct = new ModelProduct();
            $dataProduct = $modelProduct->find($kerbrgid);

            $modelKeranjang = new ModelKeranjang();
            $rowKeranjang = $modelKeranjang->cekKeranjang($kerbrgid, $keruser)->getRowArray();