app/Controllers/Home.php

SELECT *
FROM `perusahaan`
WHERE `perusahaan`.`peruid` = 1
---
    public function index()
    {
        // menampilkan data perusahaan
        $modelPerusahaan = new ModelPerusahaan();
        $rowPeru = $modelPerusahaan->find(1);

SELECT *
FROM `perusahaan`
WHERE `perusahaan`.`peruid` = 1
---
    public function katalog()
    {
        // menampilkan data perusahaan
        $modelPerusahaan = new ModelPerusahaan();
        $rowPeru = $modelPerusahaan->find(1);

SELECT *
FROM `product`
---
    function katalogTampil()
    {
        if ($this->request->isAJAX()) {
            $modelProduct = new ModelProduct();
            $dataProduct = $modelProduct->findAll();

SELECT *
FROM `users`
WHERE `users`.`userid` = 'sutino.skom@gmail.com'
---
            } else {
                $modelUser  = new ModelUsers();

                $cekUser = $modelUser->find($email);