app/Models/ModelKeranjang.php

    function ambilTotalKeranjang($iduser)
    {
        $query = $this->table('keranjang')->getWhere([
            'keruser' => $iduser
        ]);
---
SELECT *
FROM `keranjang`
WHERE `keruser` IS NULL