app/Models/ModelProduct.php

SELECT *
FROM `product`
WHERE sha1(prodid) = '356a192b7913b04c54574d18c28d46e6395428ab'
---
    public function cekProduct($id)
    {
        return $this->table('product')->getWhere([
            'sha1(prodid)' => $id
        ]);